[Killed] EqualityOperator
game-of-life/src/cell/cell.ts:6:9
   private readonly y: number;
 
   constructor(x: number, y: number) {
-    if (x < 0) {
+    if (x <= 0) {
       throw new Error(`Cell constructor: Invalid x value "${x}"`);
     }
killedBy: Cell constructor fails to build a cell if y is below zero
statusReason: Error: expect(received).toThrow(expected)

Expected message: "Cell constructor: Invalid y value \"-13\""
Received message: "Cell constructor: Invalid x value \"0\""

      77 |         } else {
      78 |           stryCov_9fa48("5");
    > 79 |           throw new Error(stryMutAct_9fa48("6") ? `` : (stryCov_9fa48("6"), `Cell constructor: Invalid x value "${x}"`));

[Killed] ConditionalExpression
game-of-life/src/cell/cell.ts:6:9
   private readonly y: number;
 
   constructor(x: number, y: number) {
-    if (x < 0) {
+    if (false) {
       throw new Error(`Cell constructor: Invalid x value "${x}"`);
     }
killedBy: Cell constructor fails to build a cell if x is below zero
statusReason: Error: expect(received).toThrow(expected)

Expected message: "Cell constructor: Invalid x value \"-1\""

Received function did not throw

[Killed] EqualityOperator
game-of-life/src/cell/cell.ts:9:9
     if (x < 0) {
       throw new Error(`Cell constructor: Invalid x value "${x}"`);
     }
-    if (y < 0) {
+    if (y <= 0) {
       throw new Error(`Cell constructor: Invalid y value "${y}"`);
     }
killedBy: Cell constructor creates a Cell for a x "0" and a y "0"
statusReason: Error: expect(received).not.toThrow()

Error name:    "Error"
Error message: "Cell constructor: Invalid y value \"0\""

      86 |         } else {
      87 |           stryCov_9fa48("11");
    > 88 |           throw new Error(stryMutAct_9fa48("12") ? `` : (stryCov_9fa48("12"), `Cell constructor: Invalid y value "${y}"`));

[Killed] ConditionalExpression
game-of-life/src/cell/cell.ts:9:9
     if (x < 0) {
       throw new Error(`Cell constructor: Invalid x value "${x}"`);
     }
-    if (y < 0) {
+    if (false) {
       throw new Error(`Cell constructor: Invalid y value "${y}"`);
     }
killedBy: Cell constructor fails to build a cell if y is below zero
statusReason: Error: expect(received).toThrow(expected)

Expected message: "Cell constructor: Invalid y value \"-13\""

Received function did not throw

[Killed] StringLiteral
game-of-life/src/cell/cell.ts:10:23
       throw new Error(`Cell constructor: Invalid x value "${x}"`);
     }
     if (y < 0) {
-      throw new Error(`Cell constructor: Invalid y value "${y}"`);
+      throw new Error(``);
     }
     this.x = x;
killedBy: Cell constructor fails to build a cell if y is below zero
statusReason: Error: expect(received).toThrow(expected)

Expected message: "Cell constructor: Invalid y value \"-13\""
Received message: ""

      86 |         } else {
      87 |           stryCov_9fa48("11");
    > 88 |           throw new Error(stryMutAct_9fa48("12") ? `` : (stryCov_9fa48("12"), `Cell constructor: Invalid y value "${y}"`));
