[Killed] BlockStatement
game-of-life/src/grid/grid.ts:13:14
     this.height = HEIGHT;
   }
 
-  getWidth() {
-    return this.width;
-  }
+  getWidth() {}
 
   getHeight() {
killedBy: Grid getWidth gets the height of the grid which is 25
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: undefined

[Killed] BlockStatement
game-of-life/src/grid/grid.ts:17:15
     return this.width;
   }
 
-  getHeight() {
-    return this.height;
-  }
+  getHeight() {}
 }
 
killedBy: Grid getHeight gets the height of the grid which is 25
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 25
Received: undefined
